In [1]:
import pandas as pd

In [3]:
dataset={'student':['harsh','kevin','avinash'],  # create dataset
        'addmission':[2022,2023,2024]}
    
demo=pd.DataFrame(dataset)  # table format use dataframe
print(demo)

   student  addmission
0    harsh        2022
1    kevin        2023
2  avinash        2024

In [4]:
print(pd.__version__)

1.4.2

In [5]:
a=[10,20,30,40]
demo1=pd.Series(a)   # create single row
print(demo1)

0    10
1    20
2    30
3    40
dtype: int64

In [9]:
demo2=pd.Series(a,index=["m1","m2","m3","m4"])
print(demo2)

m1    10
m2    20
m3    30
m4    40
dtype: int64

In [10]:
demo2=pd.Series(a,index=["m1","m2","m3","m4"])  # create index and print
print(demo2["m3"])

30

In [11]:
marks={"abc":222,"xyz":333,"mnp":444}
demo2=pd.Series(marks)
print(demo2)

abc    222
xyz    333
mnp    444
dtype: int64

In [12]:
marks={"abc":222,"xyz":333,"mnp":444}  # create key-value pair and print
demo2=pd.Series(marks)
print(demo2["abc"])     # specific print

222

In [19]:
demo2=pd.Series(marks,index=["abc","xyz"])  # print index 
print(demo2)

abc    222
xyz    333
dtype: int64

In [20]:
data={"product":["pizza","chocalate","burger"],
     "price":[100,20,30]}
demo2=pd.DataFrame(data)
print(demo2)

     product  price
0      pizza    100
1  chocalate     20
2     burger     30

In [21]:
print(demo2.loc[1])   # print location

product    chocalate
price             20
Name: 1, dtype: object

In [30]:
stmark=pd.read_csv('demo.csv')   # create csv file and print
print(stmark)

   roll no     name  total  obtain
0        1    harsh    500   490.0
1        2      NaN    500   400.0
2        3    kevin    500   450.0
3        4  avinash    500   460.0
4        5    keyur    500   489.0
5        6    paras    500   399.0
6        7    arjun    500     NaN

In [23]:
print(pd.options.display.max_rows)  # display to max rows

60

In [24]:
print(stmark.head())  # print of top marks

   roll no     name  total  obtain
0        1    harsh    500     490
1        2     ansh    500     400
2        3    kevin    500     450
3        4  avinash    500     460
4        5    keyur    500     489

In [25]:
print(stmark.tail())    # print to bottom marks

   roll no     name  total  obtain
2        3    kevin    500     450
3        4  avinash    500     460
4        5    keyur    500     489
5        6    paras    500     399
6        7    arjun    500     444

In [26]:
pd.options.display.max_rows=10
stmark=pd.read_csv('demo.csv')
print(stmark)

   roll no     name  total  obtain
0        1    harsh    500     490
1        2     ansh    500     400
2        3    kevin    500     450
3        4  avinash    500     460
4        5    keyur    500     489
5        6    paras    500     399
6        7    arjun    500     444

In [27]:
print(stmark.info())   # information of csv file

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 4 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   roll no  7 non-null      int64
 1   name     7 non-null      object
 2   total    7 non-null      int64
 3   obtain   7 non-null      int64
dtypes: int64(3), object(1)
memory usage: 352.0+ bytes
None

In [31]:
new_stud=stmark.dropna()
print(new_stud)

   roll no     name  total  obtain
0        1    harsh    500   490.0
2        3    kevin    500   450.0
3        4  avinash    500   460.0
4        5    keyur    500   489.0
5        6    paras    500   399.0

In [32]:
fill_stud=stmark.fillna(222)
print(fill_stud)

   roll no     name  total  obtain
0        1    harsh    500   490.0
1        2      222    500   400.0
2        3    kevin    500   450.0
3        4  avinash    500   460.0
4        5    keyur    500   489.0
5        6    paras    500   399.0
6        7    arjun    500   222.0

In [36]:
stu1=stmark["obtain"].fillna(777)
print(stu1)

0    490.0
1    400.0
2    450.0
3    460.0
4    489.0
5    399.0
6    777.0
Name: obtain, dtype: float64

In [39]:
stmark["obtain"].fillna(777,inplace=True)
print(stmark)

   roll no     name  total  obtain
0        1    harsh    500   490.0
1        2      NaN    500   400.0
2        3    kevin    500   450.0
3        4  avinash    500   460.0
4        5    keyur    500   489.0
5        6    paras    500   399.0
6        7    arjun    500   777.0

In [45]:
n="brijesh"
stmark["name"].fillna(n,inplace=True)
print(stmark)

   roll no     name  total  obtain
0        1    harsh    500   490.0
1        2      777    500   400.0
2        3    kevin    500   450.0
3        4  avinash    500   460.0
4        5    keyur    500   489.0
5        6    paras    500   399.0
6        7    arjun    500   777.0

In [47]:
mean=stmark["obtain"].mean()
print(mean)

495.0

In [54]:
median=stmark["obtain"].median()
print("Median is: ",median)

Median is:  460.0

In [53]:
mode=stmark["obtain"].mode()
print("Mode is: ",mode)

Mode is:  0    399.0
1    400.0
2    450.0
3    460.0
4    489.0
5    490.0
6    777.0
Name: obtain, dtype: float64

In [51]:
stmark.columns  # get column name is csv file

Index(['roll no', 'name', 'total', 'obtain'], dtype='object')

In [55]:
print(stmark.loc[0:2])   # print location

   roll no   name  total  obtain
0        1  harsh    500   490.0
1        2    777    500   400.0
2        3  kevin    500   450.0

In [57]:
stmark.sort_values(["obtain"],ascending=0)   # ascending value

   roll no     name  total  obtain
6        7    arjun    500   777.0
0        1    harsh    500   490.0
4        5    keyur    500   489.0
3        4  avinash    500   460.0
2        3    kevin    500   450.0
1        2      777    500   400.0
5        6    paras    500   399.0

In [60]:
stmark.sort_values(["obtain"],ascending=1)  # desending value

   roll no     name  total  obtain
5        6    paras    500   399.0
1        2      777    500   400.0
2        3    kevin    500   450.0
3        4  avinash    500   460.0
4        5    keyur    500   489.0
0        1    harsh    500   490.0
6        7    arjun    500   777.0

In [62]:
stmark['Percentage']=(stmark["obtain"]/stmark["total"])*100
stmark.head(5)               # add percentage filed

   roll no     name  total  obtain  percentage  Percentage
0        1    harsh    500   490.0        98.0        98.0
1        2      777    500   400.0        80.0        80.0
2        3    kevin    500   450.0        90.0        90.0
3        4  avinash    500   460.0        92.0        92.0
4        5    keyur    500   489.0        97.8        97.8